       IDENTIFICATION DIVISON.

       PROGRAM-ID HELLO.
       PROCEDURE DIVISION.
           DISPLAY "HELLO, FEELS GREAT TO START LEARNING A LANG. STARTED IN 1950s".
           STOP RUN
           